particle-iot/device-os/hal/src/nRF52840/usart_hal.cpp
        if (nrf_uarte_int_enable_check(uarte_, NRF_UARTE_INT_TXDRDY_MASK)) {
            if (nrf_uarte_event_check(uarte_, NRF_UARTE_EVENT_TXDRDY)) {
                nrf_uarte_int_disable(uarte_, NRF_UARTE_INT_TXDRDY_MASK);
                nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_TXDRDY);
                BaseType_t yieldTx = pdFALSE;
                if (xEventGroupSetBitsFromISR(evGroup_, HAL_USART_PVT_EVENT_WRITABLE, &yieldTx) != pdFAIL) {
                    eventGenerated = true;
                }
                yield = yield || yieldTx;
            }
        }

        // IMPORTANT: we cannot process ENDRX event if we are under the RX lock (ENDRX interrupt is disabled)
        if (nrf_uarte_int_enable_check(uarte_, NRF_UARTE_INT_ENDRX_MASK)) {
            if (nrf_uarte_event_check(uarte_, NRF_UARTE_EVENT_ENDRX)) {
                nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_ENDRX);
                nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_RXDRDY);

                particle::services::RingBuffer<uint8_t>* buffer = nullptr;
                if (usingAltRxBuffer_) {
                    buffer = &rxBufferAlt_;
                } else {
                    buffer = &rxBuffer_;
                }

                if (buffer->acquirePending() > 0) {
                    size_t remain = buffer->acquirePending();
                    buffer->acquireCommit(remain);
                    consumedTimerCount_ = (consumedTimerCount_ + remain) % 65536;
                }

                if (uarte_->SHORTS & NRF_UARTE_SHORT_ENDRX_STARTRX) {
                    usingAltRxBuffer_ = !usingAltRxBuffer_;
                }
            }
        }

        if (nrf_uarte_int_enable_check(uarte_, NRF_UARTE_INT_RXSTARTED_MASK)) {
            if (nrf_uarte_event_check(uarte_, NRF_UARTE_EVENT_RXSTARTED)) {
                nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_RXSTARTED);
                if (prepareNextRingBuffer() <= 0) {
                    nrf_uarte_shorts_disable(uarte_, NRF_UARTE_SHORT_ENDRX_STARTRX);
                }
            }
        }

        // IMPORTANT: we cannot process ENDTX event if we are under the TX lock (ENDTX interrupt is disabled)
        if (nrf_uarte_int_enable_check(uarte_, NRF_UARTE_INT_ENDTX_MASK)) {
            if (nrf_uarte_event_check(uarte_, NRF_UARTE_EVENT_ENDTX)) {
                nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_ENDTX);
                nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_TXDRDY);
                txBuffer_.consumeCommit(nrf_uarte_tx_amount_get(uarte_));
                transmitting_ = false;
                startTransmission();
            }
        }
        if (nrf_uarte_event_check(uarte_, NRF_UARTE_EVENT_ERROR)) {
            nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_ERROR);
            uint32_t uartErrorSource = nrf_uarte_errorsrc_get_and_clear(uarte_);
            (void)uartErrorSource;
        }

        if (eventGenerated) {
            portYIELD_FROM_ISR(yield);
        }
    }

    EventGroupHandle_t eventGroup() {
        return evGroup_;
    }

    int enableEvent(HAL_USART_Pvt_Events event) {
        if (event & HAL_USART_PVT_EVENT_READABLE) {
            if (data() <= 0) {
                nrf_uarte_int_disable(uarte_, NRF_UARTE_INT_RXDRDY_MASK);
                nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_RXDRDY);
                nrf_uarte_int_enable(uarte_, NRF_UARTE_INT_RXDRDY_MASK);
            } else {
                xEventGroupSetBits(evGroup_, HAL_USART_PVT_EVENT_READABLE);
            }
        }

        if (event & HAL_USART_PVT_EVENT_WRITABLE) {
            if (space() <= 0) {
                nrf_uarte_int_disable(uarte_, NRF_UARTE_INT_TXDRDY_MASK);
                nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_TXDRDY);
                nrf_uarte_int_enable(uarte_, NRF_UARTE_INT_TXDRDY_MASK);
            } else {
                xEventGroupSetBits(evGroup_, HAL_USART_PVT_EVENT_WRITABLE);
            }
        }

        return SYSTEM_ERROR_NONE;
    }

    int disableEvent(HAL_USART_Pvt_Events event) {
        if (event & HAL_USART_PVT_EVENT_READABLE) {
            nrf_uarte_int_disable(uarte_, NRF_UARTE_INT_RXDRDY_MASK);
            xEventGroupClearBits(evGroup_, HAL_USART_PVT_EVENT_READABLE);
        }

        if (event & HAL_USART_PVT_EVENT_WRITABLE) {
            nrf_uarte_int_disable(uarte_, NRF_UARTE_INT_TXDRDY_MASK);
            xEventGroupClearBits(evGroup_, HAL_USART_PVT_EVENT_WRITABLE);
        }

        return SYSTEM_ERROR_NONE;
    }

    int waitEvent(uint32_t events, system_tick_t timeout) {
        CHECK(enableEvent((HAL_USART_Pvt_Events)events));

        auto res = xEventGroupWaitBits(evGroup_, events, pdTRUE, pdFALSE, timeout / portTICK_RATE_MS);
        return res;
    }

private:
    int disable(bool end = true) {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);

        disableInterrupts();
        stopTransmission();
        stopReceiver();

        nrf_uarte_disable(uarte_);
        nrf_uarte_txrx_pins_disconnect(uarte_);
        nrf_uarte_hwfc_pins_disconnect(uarte_);
        nrfx_prs_release(uarte_);

        disableTimer();

        // Configuring the input pins' mode to PIN_MODE_NONE will disconnect input buffer to enable power savings
        // Configuring the output pins' mode to INPUT_PULLUP to not polluting the state on other side.
        hal_gpio_mode(txPin_, end ? PIN_MODE_NONE : INPUT_PULLUP);
        hal_gpio_mode(rxPin_, PIN_MODE_NONE);
        if (config_.config & SERIAL_FLOW_CONTROL_RTS) {
            hal_gpio_mode(rtsPin_, end ? PIN_MODE_NONE : INPUT_PULLUP);
        }
        if (config_.config & SERIAL_FLOW_CONTROL_CTS) {
            hal_gpio_mode(ctsPin_, PIN_MODE_NONE);
        }
        if (end) {
            hal_pin_set_function(txPin_, PF_NONE);
            hal_pin_set_function(rxPin_, PF_NONE);
            if (config_.config & SERIAL_FLOW_CONTROL_RTS) {
                hal_pin_set_function(rtsPin_, PF_NONE);
            }
            if (config_.config & SERIAL_FLOW_CONTROL_CTS) {
                hal_pin_set_function(ctsPin_, PF_NONE);
            }
        }

        return SYSTEM_ERROR_NONE;
    }

    void startTransmission() {
        size_t consumable;
        if (!transmitting_ && (consumable = txBuffer_.consumable())) {
            transmitting_ = true;
            auto ptr = txBuffer_.consume(consumable);
#ifdef DEBUG_BUILD
            SPARK_ASSERT(ptr);
#endif // DEBUG_BUILD
            nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_TXDRDY);
            nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_ENDTX);
            nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_TXSTOPPED);
            nrf_uarte_tx_buffer_set(uarte_, ptr, consumable);
            nrf_uarte_task_trigger(uarte_, NRF_UARTE_TASK_STARTTX);
        }
    }

